/**
 * 奖励类型
 */
// const enum RewardType {
//     /**
//      * 人民币
//      */
//     RMB = 0,
//     /**
//      * 代币
//      */
//     Token = 1,
//     /**
//      * 金币
//      */
//     Glod = 2,
//     /**
//      * 修为
//      */
//     Cultivation = 3,
//     /**
//      * 佛光
//      */
//     Buddha = 4,
//     /**
//      * 神魔碎片1黑熊精
//      */
//     GhostDebris1 = 1001,
//     /**
//      * 神魔碎片2白骨精
//      */
//     GhostDebris2 = 1002,
//     /**
//      * 神魔碎片3弥勒佛
//      */
//     GhostDebris3 = 1003,
//     /**
//      * 神魔碎片4哪吒
//      */
//     GhostDebris4 = 1004,
//     /**
//      * 神魔碎片5托塔天王
//      */
//     GhostDebris5 = 1005,
//     /**
//      * 神魔碎片6如来佛祖
//      */
//     GhostDebris6 = 1006,
//     /**
//      * 神魔碎片7金角大王
//      */
//     GhostDebris7 = 1007,
//     /**
//      * 神魔碎片8金池长老
//      */
//     GhostDebris8 = 1008,
//     /**
//      * 神魔碎片9太上老君
//      */
//     GhostDebris9 = 1009,
//     /**
//      * 神魔碎片10牛魔王
//      */
//     GhostDebris10 = 1010,
//     /**
//      * 神魔碎片11刁钻古怪
//      */
//     GhostDebris11 = 1011,
//     /**
//      * 神魔碎片12精细鬼
//      */
//     GhostDebris12 = 1012,
//     /**
//      * 神魔碎片13奔波儿灞
//      */
//     GhostDebris13 = 1013,
//     /**
//      * 神魔碎片14大钻风
//      */
//     GhostDebris14 = 1014,
//     /**
//      * 神魔碎片15龟丞相
//      */
//     GhostDebris15 = 1015,
//     /**
//      * 神魔碎片16拟人桃子
//      */
//     GhostDebris16 = 1016,
//     /**
//      * 神魔碎片17拟人西瓜
//      */
//     GhostDebris17 = 1017,
//     /**
//      * 神魔碎片18拟人梨子
//      */
//     GhostDebris18 = 1018,
//     /**
//      * 神魔碎片19拟人葡萄
//      */
//     GhostDebris19 = 1019,
//     /**
//      * 神魔碎片20拟人苹果
//      */
//     GhostDebris20 = 1020,
//     /**
//      * 神魔碎片21女弓手
//      */
//     GhostDebris21 = 1021,
//     /**
//      * 神魔碎片22虾兵
//      */
//     GhostDebris22 = 1022,
//     /**
//      * 神魔碎片23蟹将
//      */
//     GhostDebris23 = 1023,
//     /**
//      * 神魔碎片24仙童
//      */
//     GhostDebris24 = 1024,
//     /**
//      * 神魔碎片25仙女
//      */
//     GhostDebris25 = 1025,
//     /**
//      * 伤害*1.5
//      */
//     AddHurt = 2001,
//     /**
//      * 金钱获得*1.5
//      */
//     AddGlod = 2002,
//     /**
//      * 修为*1.5
//      */
//     AddCultivation = 2003,
//     /**
//      * 月卡*1.5
//      */
//     VIP = 2004,
//     /**
//      * 宠物2仙石
//      */
//     Pet2 = 4001,
//     /**
//      * 宠物3卷帘大将
//      */
//     Pet3 = 4002,
//     /**
//      * 宠物4天蓬元帅
//      */
//     Pet4 = 4003,
//     /**
//      * 宠物5东海太子
//      */
//     Pet5 = 4004,
//     /**
//      * 宠物6东土圣僧
//      */
//     Pet6 = 4005,
// };

// const RewardName = {
//     1: '钻石',
//     2: '金币',
//     3: '魂石',
//     4: '圣光',
//     7: '强化碎片',
//     8: '进阶碎片',
//     9: '体力值',
//     10:'圣光转移',
//     2001: '鼓舞',
//     2002: '万金',
// };

// /**
//  * 奖励类型管理
//  */
// class RewardManager{
// }

